{
  "title": "Louisiana's Way Home",
  "coverImage": "/assets/louisianas-way-home.jpg",
  "colorSchema": {
    "primary": "#3c6c4c",
    "secondary": "#c04b37"
  },
  "level": "B2",
  "words": [
    {
      "word": "curse",
      "ipa": "/kɜːrs/",
      "meaning": [
        {
          "vi": "lời nguyền, sự rủa xả",
          "example_en": "He set into motion a most terrible curse.",
          "example_vi": "Anh ta đã khởi động một lời nguyền vô cùng khủng khiếp.",
          "note": "Thường dùng khi nói về sự trừng phạt siêu nhiên hoặc lời nguyền mang lại xui xẻo."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "land upon",
      "ipa": "/lænd əˈpɒn/",
      "meaning": [
        {
          "vi": "rơi vào, rơi xuống (trong ngữ cảnh mô tả vật thể hoặc sự kiện xảy ra một cách đột ngột)",
          "example_en": "It has landed upon my head.",
          "example_vi": "Nó đã giáng xuống đầu tôi",
          "note": "Cụm từ này thường dùng để mô tả sự việc xảy ra một cách bất ngờ hoặc đột ngột, có thể là vật rơi xuống hoặc sự việc đột ngột xảy đến."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "reckoning",
      "ipa": "/ˈrɛkənɪŋ/",
      "meaning": [
        {
          "vi": "sự tính toán, sự phán xét (thường là một sự kiện quan trọng, thường mang tính trừng phạt)",
          "example_en": "The day of reckoning has arrived.",
          "example_vi": "Ngày phán xét đã đến.",
          "note": "Cụm từ này thường dùng trong ngữ cảnh chỉ một sự kiện quan trọng, lúc mà mọi hành động hay quyết định phải được đền đáp, đặc biệt là theo hướng tiêu cực."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "constellation",
      "ipa": "/ˌkɒnstəˈleɪʃən/",
      "meaning": [
        {
          "vi": "chòm sao, nhóm sao tạo thành hình dạng nhất định trên bầu trời",
          "example_en": "The Pinocchio constellation is named after the famous puppet.",
          "example_vi": "Chòm sao Pinocchio được đặt theo tên con rối nổi tiếng.",
          "note": "Từ này thường dùng để chỉ các nhóm sao trên bầu trời, có thể dùng trong ngữ cảnh khoa học hoặc văn học, như tên các chòm sao hoặc trong các câu chuyện."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "windshield",
      "ipa": "/ˈwɪndʃiːld/",
      "meaning": [
        {
          "vi": "kính chắn gió (trước xe ô tô)",
          "example_en": "It was lighting up the splotches and stains on the windshield.",
          "example_vi": "Nó chiếu sáng các vết bẩn và vết ố trên kính chắn gió.",
          "note": "Dùng để chỉ kính chắn gió của xe ô tô, có chức năng bảo vệ người lái và hành khách khỏi gió, bụi, và các yếu tố môi trường."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "vain",
      "ipa": "/veɪn/",
      "meaning": [
        {
          "vi": "hão huyền, tự phụ, kiêu ngạo",
          "example_en": "She is too vain to wear glasses.",
          "example_vi": "Cô ấy quá tự phụ để đeo kính.",
          "note": "Từ này thường dùng để mô tả người quá coi trọng vẻ ngoài hoặc bản thân, đôi khi dẫn đến hành động kiêu ngạo hoặc tự mãn."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "glow-in-the-dark stars",
      "ipa": "/ɡloʊ ɪn ðə dɑːrk stɑːrz/",
      "meaning": [
        {
          "vi": "những ngôi sao phát sáng trong bóng tối",
          "example_en": "Oh, how I wish that someone had pasted glow-in-the-dark stars on our windshield.",
          "example_vi": "Ôi, tôi ước gì ai đó đã dán những ngôi sao phát sáng trong bóng tối lên kính chắn gió của chúng tôi.",
          "note": "Cụm từ này mô tả những ngôi sao giả có thể phát sáng trong bóng tối, thường được sử dụng trong các sản phẩm trang trí hoặc đồ chơi."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "confront",
      "ipa": "/kənˈfrʌnt/",
      "meaning": [
        {
          "vi": "đối mặt, đối diện với (thường là một vấn đề hoặc tình huống khó khăn)",
          "example_en": "The curse at last must be confronted.",
          "example_vi": "Lời nguyền cuối cùng phải được đối mặt.",
          "note": "Thường dùng trong ngữ cảnh phải đối diện với một vấn đề, thử thách hoặc tình huống khó khăn."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "account",
      "ipa": "/əˈkaʊnt/",
      "meaning": [
        {
          "vi": "bản tường thuật, sự kể lại, bản báo cáo",
          "example_en": "At this point in my account of what became of me.",
          "example_vi": "Vào thời điểm này trong bản tường thuật của tôi về những gì đã xảy ra với tôi.",
          "note": "Thường dùng để chỉ sự tường thuật hoặc kể lại một câu chuyện, sự kiện."
        }
      ],
      "cefr_level": "B1",
      "favorite": false
    },
    {
      "word": "irrevocableness",
      "ipa": "/ɪˌrɛvəˈkæbəlnɪs/",
      "meaning": [
        {
          "vi": "không thể thay đổi, không thể hủy bỏ",
          "example_en": "All I can say is that I had a sudden feeling of irrevocableness.",
          "example_vi": "Tất cả những gì tôi có thể nói là tôi đã có một cảm giác đột ngột về sự không thể thay đổi.",
          "note": "Dùng để mô tả trạng thái không thể thay đổi hoặc không thể hủy bỏ."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "intervene",
      "ipa": "/ˌɪntərˈviːn/",
      "meaning": [
        {
          "vi": "can thiệp, xen vào",
          "example_en": "Because fate intervened.",
          "example_vi": "Vì số phận đã can thiệp.",
          "note": "Thường dùng khi ai đó hoặc điều gì đó xen vào một tình huống, gây ảnh hưởng hoặc thay đổi diễn biến."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "irrevocable",
      "ipa": "/ɪˈrɛvəˌkɑːbəl/",
      "meaning": [
        {
          "vi": "không thể thay đổi, không thể hủy bỏ",
          "example_en": "Somewhere just past the irrevocable state line.",
          "example_vi": "Nơi nào đó chỉ qua ranh giới không thể thay đổi.",
          "note": "Dùng để mô tả điều gì đó không thể thay đổi hoặc hủy bỏ, thường là quyết định hoặc tình huống không thể đảo ngược."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "the utter devastation",
      "ipa": "/ðə ˈʌtər ˌdɛvəˈsteɪʃən/",
      "meaning": [
        {
          "vi": "sự tàn phá hoàn toàn, sự hủy diệt tuyệt đối",
          "example_en": "So that you will understand the desperation — the utter devastation — in my heart.",
          "example_vi": "Để bạn hiểu sự tuyệt vọng — sự tàn phá hoàn toàn — trong trái tim tôi.",
          "note": "Cụm từ này nhấn mạnh sự tàn phá, hủy diệt tuyệt đối, thường dùng trong ngữ cảnh cảm xúc mạnh mẽ hoặc tình huống thảm khốc."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "semi",
      "ipa": "/ˈsɛmɪ/",
      "meaning": [
        {
          "vi": "xe tải hạng nặng, xe chở hàng",
          "example_en": "Three semis drove past us.",
          "example_vi": "Ba chiếc xe tải hạng nặng chạy qua chúng tôi.",
          "note": "Là dạng viết tắt của 'semi-truck' hoặc 'tractor-trailer', chỉ các xe tải lớn chở hàng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "inopportune",
      "ipa": "/ˌɪnɒpərˈtjuːn/",
      "meaning": [
        {
          "vi": "không thích hợp, không đúng thời điểm",
          "example_en": "This conversation is inopportune.",
          "example_vi": "Cuộc trò chuyện này không thích hợp.",
          "note": "Dùng để chỉ một điều gì đó xảy ra vào thời điểm không thuận lợi hoặc không thích hợp."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "nonetheless",
      "ipa": "/ˌnʌnðəˈlɛs/",
      "meaning": [
        {
          "vi": "mặc dù vậy, tuy nhiên",
          "example_en": "But nonetheless, I am persevering. As should you.",
          "example_vi": "Mặc dù vậy, tôi vẫn kiên trì. Bạn cũng nên vậy.",
          "note": "Dùng để diễn tả sự tiếp tục hoặc hành động xảy ra mặc dù có những yếu tố hoặc tình huống trái ngược trước đó."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "impose",
      "ipa": "/ɪmˈpəʊz/",
      "meaning": [
        {
          "vi": "làm phiền, áp đặt, yêu cầu quá mức",
          "example_en": "Granny and I were always imposing on people.",
          "example_vi": "Bà và tôi luôn làm phiền người khác.",
          "note": "Dùng khi nói về hành động yêu cầu sự giúp đỡ hoặc dịch vụ từ người khác mà không cần sự đồng ý rõ ràng, hoặc làm điều gì đó mà người khác có thể cảm thấy không thoải mái."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "impose upon",
      "ipa": "/ɪmˈpəʊz əˈpɒn/",
      "meaning": [
        {
          "vi": "làm phiền, yêu cầu một cách không thoải mái hoặc quá mức",
          "example_en": "Could we impose upon you for a ride to the nearest gas station and back again?",
          "example_vi": "Chúng tôi có thể làm phiền bạn cho một chuyến đi đến trạm xăng gần nhất và quay lại không?",
          "note": "Cụm từ này thường dùng khi yêu cầu ai đó làm điều gì đó mà họ có thể cảm thấy không thoải mái hoặc là một sự yêu cầu quá mức."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "squint",
      "ipa": "/skwɪnt/",
      "meaning": [
        {
          "vi": "nheo mắt",
          "example_en": "If you squinted, it did. If you squinted really hard.",
          "example_vi": "Nếu bạn nheo mắt, nó đã làm vậy. Nếu bạn nheo mắt thật chặt.",
          "note": "Dùng để chỉ hành động nheo mắt lại để nhìn rõ hơn, đặc biệt khi ánh sáng yếu hoặc khi vật thể mờ."
        }
      ],
      "cefr_level": "B1",
      "favorite": false
    },
    {
      "word": "exasperated noise",
      "ipa": "/ɪɡˈzæspəreɪtɪd nɔɪz/",
      "meaning": [
        {
          "vi": "tiếng bực bội, tiếng giận dữ",
          "example_en": "The chair made a squeaky exasperated noise as it rolled toward me.",
          "example_vi": "Chiếc ghế phát ra một tiếng kêu squeaky đầy bực bội khi nó lăn về phía tôi.",
          "note": "Cụm từ này mô tả một tiếng động, thường phát ra từ một vật thể, giống như sự giận dữ hoặc sự bực bội, có thể dùng trong ngữ cảnh mô tả âm thanh khó chịu hoặc cứng nhắc."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "swirly gold letters",
      "ipa": "/ˈswɜːrli ɡəʊld ˈlɛtəz/",
      "meaning": [
        {
          "vi": "chữ vàng xoáy, chữ vàng uốn lượn",
          "example_en": "The calendar said OCTOBER 1977 in swirly gold letters.",
          "example_vi": "Lịch có chữ 'OCTOBER 1977' bằng chữ vàng xoáy.",
          "note": "Cụm từ này mô tả kiểu chữ uốn lượn, thường là kiểu chữ trang trí cầu kỳ và đẹp mắt, với màu vàng sáng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "greasy black fingerprints",
      "ipa": "/ˈɡriːsi blæk ˈfɪŋɡəprɪnts/",
      "meaning": [
        {
          "vi": "vết tay đen nhờn",
          "example_en": "It was mounted on the wall, and it was covered with greasy black fingerprints.",
          "example_vi": "Nó được gắn trên tường, và nó phủ đầy vết tay đen nhờn.",
          "note": "Cụm từ này mô tả những vết tay để lại trên bề mặt vật thể, có màu đen và dính dầu, thường thấy trên các bề mặt dễ bị bẩn như kính hoặc nhựa."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "abiding love",
      "ipa": "/əˈbaɪdɪŋ lʌv/",
      "meaning": [
        {
          "vi": "tình yêu bền bỉ, tình yêu vĩnh cửu",
          "example_en": "You can turn your face away from me, but it does not change my abiding love for you.",
          "example_vi": "Bạn có thể quay mặt đi khỏi tôi, nhưng nó không thay đổi tình yêu bền bỉ của tôi dành cho bạn.",
          "note": "Cụm từ này mô tả tình yêu sâu sắc và bền vững, không thay đổi theo thời gian hoặc hoàn cảnh."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "hobble",
      "ipa": "/ˈhɒbl/",
      "meaning": [
        {
          "vi": "cản trở, làm khó khăn (thường dùng khi bị giới hạn về khả năng di chuyển hoặc hành động)",
          "example_en": "I must tell you that I feel somewhat hobbled by my unwellness.",
          "example_vi": "Tôi phải nói với bạn rằng tôi cảm thấy bị cản trở bởi tình trạng sức khỏe của mình.",
          "note": "Dùng khi miêu tả cảm giác bị hạn chế hoặc không thể làm gì đó một cách dễ dàng do yếu tố nào đó, thường là sức khỏe hoặc hoàn cảnh."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "sundering",
      "ipa": "/ˈsʌndərɪŋ/",
      "meaning": [
        {
          "vi": "sự chia cắt, sự tan vỡ",
          "example_en": "It is a curse of sundering.",
          "example_vi": "Đó là lời nguyền của sự chia cắt.",
          "note": "Dùng khi nói về hành động chia rẽ, phá vỡ, hoặc làm cho hai hoặc nhiều thứ không còn liên kết với nhau."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "whimper",
      "ipa": "/ˈwɪmpər/",
      "meaning": [
        {
          "vi": "khóc thút thít, rên rỉ",
          "example_en": "Granny started to whimper.",
          "example_vi": "Bà bắt đầu rên rỉ.",
          "note": "Dùng để miêu tả âm thanh khóc thút thít, thường là do đau đớn hoặc cảm xúc mạnh mẽ."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "crank",
      "ipa": "/kræŋk/",
      "meaning": [
        {
          "vi": "xoay, quay (thường dùng khi khởi động động cơ hoặc một cơ chế nào đó bằng cách quay tay)",
          "example_en": "Louisiana Elefante slid behind the wheel of the car and cranked the engine.",
          "example_vi": "Louisiana Elefante ngồi vào ghế lái và quay chìa khóa để khởi động động cơ.",
          "note": "Từ này thường dùng để chỉ hành động quay hoặc xoay để khởi động một cái gì đó, như quay chìa khóa để khởi động xe."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "pull out onto",
      "ipa": "/pʊl aʊt ˈɒntə/",
      "meaning": [
        {
          "vi": "rẽ ra, ra ngoài (thường dùng khi điều khiển xe từ nơi đậu vào đường chính)",
          "example_en": "Put the blinker on and pulled out onto the highway.",
          "example_vi": "Bật đèn xi nhan và rẽ ra đường cao tốc.",
          "note": "Cụm từ này dùng để mô tả hành động lái xe từ nơi đỗ hoặc đường phụ ra vào đường chính hoặc đường lớn."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "pecan pies",
      "ipa": "/ˈpiːkæn paɪz/",
      "meaning": [
        {
          "vi": "bánh quả hồ đào (pecan)",
          "example_en": "There were billboards for real estate and hotels and pecan pie.",
          "example_vi": "Có biển quảng cáo cho bất động sản, khách sạn và bánh quả hồ đào.",
          "note": "Pecan pie là một món bánh nổi tiếng ở Mỹ, được làm từ quả hồ đào (pecan) và thường được ăn vào các dịp lễ tết."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "saw",
      "ipa": "/sɔː/",
      "meaning": [
        {
          "vi": "cưa, cắt (thường dùng với một vật thể lớn hoặc bằng dụng cụ cưa)",
          "example_en": "The curse came about because my great-grandfather (the magician) sawed my great-grandmother in half.",
          "example_vi": "Lời nguyền xảy ra vì ông cố tôi (pháp sư) đã cưa bà cố tôi làm đôi.",
          "note": "Dùng để chỉ hành động cắt hoặc chia một vật lớn ra bằng cưa, có thể là vật thể vật lý hoặc có tính ẩn dụ trong các câu chuyện."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "disastrous",
      "ipa": "/dɪˈzæstrəs/",
      "meaning": [
        {
          "vi": "thảm khốc, tai hại",
          "example_en": "This, as you can imagine, had disastrous and far-reaching consequences.",
          "example_vi": "Như bạn có thể tưởng tượng, điều này đã có những hậu quả thảm khốc và kéo dài.",
          "note": "Dùng để miêu tả một sự kiện hoặc tình huống gây ra hậu quả tồi tệ hoặc nghiêm trọng, thường là không thể khắc phục được."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "cricket",
      "ipa": "/ˈkrɪkɪt/",
      "meaning": [
        {
          "vi": "con dế",
          "example_en": "I could hear a cricket chirping.",
          "example_vi": "Tôi có thể nghe thấy tiếng dế kêu.",
          "note": "Cricket là một loài côn trùng nhỏ, thường phát ra âm thanh kêu rả rích, phổ biến vào ban đêm."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "insubstantial",
      "ipa": "/ˌɪnsəbˈstænʃəl/",
      "meaning": [
        {
          "vi": "không có thực, không vững chắc, mờ nhạt",
          "example_en": "That has got to be the most insubstantial thing of all.",
          "example_vi": "Đó chắc chắn là thứ không vững chắc nhất trong tất cả.",
          "note": "Dùng để mô tả một điều gì đó không có thực chất, không vững vàng, hoặc thiếu sự mạnh mẽ, rõ ràng."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "spluttery",
      "ipa": "/ˈsplʌtəri/",
      "meaning": [
        {
          "vi": "tiếng nổ lốp bốp, tiếng khò khè (thường là do động cơ không hoạt động tốt)",
          "example_en": "The engine was making some spluttery noises, but it was still going.",
          "example_vi": "Động cơ phát ra những tiếng nổ lốp bốp, nhưng vẫn tiếp tục hoạt động.",
          "note": "Dùng để miêu tả những âm thanh lạ hoặc rối rít, thường là do động cơ hoặc máy móc không hoạt động mượt mà."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "embankment",
      "ipa": "/ɪmˈbæŋkmənt/",
      "meaning": [
        {
          "vi": "đê, bờ đê, con đường đất hoặc đá được xây dựng để ngăn chặn nước hoặc làm nền tảng cho đường đi",
          "example_en": "I applied the gas, and the car went roaring up the embankment and back onto the macadam.",
          "example_vi": "Tôi đạp ga, và chiếc xe lao lên bờ đê rồi quay lại đường macadam.",
          "note": "Embankment thường được xây dựng để ngăn chặn lũ lụt, hoặc làm con đường có độ dốc đi lên hoặc xuống."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "interfere",
      "ipa": "/ˌɪntəˈfɪə/",
      "meaning": [
        {
          "vi": "can thiệp, làm phiền, gây cản trở",
          "example_en": "Days of reckoning interfere with big plans.",
          "example_vi": "Những ngày phán xét can thiệp vào những kế hoạch lớn.",
          "note": "Dùng để miêu tả hành động xen vào hoặc làm gián đoạn một quá trình, kế hoạch hoặc hoạt động."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "in my defense",
      "ipa": "/ɪn maɪ dɪˈfɛns/",
      "meaning": [
        {
          "vi": "theo sự bảo vệ của tôi, để biện minh cho mình",
          "example_en": "What can I say in my defense except that I was very angry?",
          "example_vi": "Tôi có thể nói gì để biện minh cho mình ngoài việc tôi rất tức giận?",
          "note": "Cụm từ này dùng khi bạn muốn biện minh hoặc giải thích hành động của mình trong một tình huống nào đó."
        }
      ],
      "cefr_level": "B2",
      "favorite": true
    },
    {
      "word": "circumstances",
      "ipa": "/ˈsɜːkəmstænsɪz/",
      "meaning": [
        {
          "vi": "hoàn cảnh, tình huống",
          "example_en": "I was doing my best under difficult circumstances.",
          "example_vi": "Tôi đã làm hết sức mình trong những hoàn cảnh khó khăn.",
          "note": "Dùng để chỉ các yếu tố hoặc tình huống xung quanh một sự kiện hoặc hành động, ảnh hưởng đến kết quả hoặc cách thức thực hiện."
        }
      ],
      "cefr_level": "B1",
      "favorite": false
    },
    {
      "word": "juncture",
      "ipa": "/ˈdʒʌŋktʃər/",
      "meaning": [
        {
          "vi": "thời điểm quan trọng, giai đoạn, điểm mấu chốt",
          "example_en": "That is an irrelevant question at this juncture.",
          "example_vi": "Đó là một câu hỏi không liên quan vào thời điểm quan trọng này.",
          "note": "Dùng để chỉ một thời điểm hoặc giai đoạn quan trọng trong một quá trình hoặc tình huống."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "exploits",
      "ipa": "/ˈɛksplɔɪts/",
      "meaning": [
        {
          "vi": "chiến công, thành tích, hành động phi thường",
          "example_en": "I was going to tell her about my amazing exploits.",
          "example_vi": "Tôi định kể cho cô ấy về những chiến công tuyệt vời của mình.",
          "note": "Dùng để chỉ những hành động hoặc thành tích đặc biệt, thường là phi thường, trong các tình huống đầy thử thách hoặc mạo hiểm."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "battle of the wills",
      "ipa": "/ˈbætl ʌv ðə wɪlz/",
      "meaning": [
        {
          "vi": "cuộc đấu tranh ý chí, cuộc thi đấu xem ai kiên quyết hơn",
          "example_en": "She always told me that I could win any battle of the wills.",
          "example_vi": "Cô ấy luôn nói với tôi rằng tôi có thể thắng bất kỳ cuộc đấu tranh ý chí nào.",
          "note": "Cụm từ này mô tả một tình huống mà hai người hoặc nhiều người tranh đấu với nhau, mỗi người kiên quyết bảo vệ quan điểm hoặc mục tiêu của mình."
        }
      ],
      "cefr_level": "B2",
      "favorite": true
    },
    {
      "word": "give in",
      "ipa": "/ɡɪv ɪn/",
      "meaning": [
        {
          "vi": "nhượng bộ, đầu hàng",
          "example_en": "The trick is to never give in.",
          "example_vi": "Mẹo là không bao giờ nhượng bộ.",
          "note": "Cụm từ này dùng khi bạn chấp nhận hoặc đầu hàng trước một yêu cầu hoặc áp lực sau khi đã đấu tranh hoặc kiên trì."
        }
      ],
      "cefr_level": "B2",
      "favorite": true
    },
    {
      "word": "cease",
      "ipa": "/siːs/",
      "meaning": [
        {
          "vi": "dừng lại, ngừng",
          "example_en": "And in any case, it all ceased to matter.",
          "example_vi": "Và dù sao đi nữa, tất cả đều không còn quan trọng nữa.",
          "note": "Dùng để chỉ hành động ngừng lại hoặc dừng một cái gì đó, không còn tiếp tục nữa."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "came staggering",
      "ipa": "/keɪm ˈstæɡərɪŋ/",
      "meaning": [
        {
          "vi": "lảo đảo, đi loạng choạng",
          "example_en": "Granny opened the door to Dr. Fox’s office and came staggering in with her hand to her mouth.",
          "example_vi": "Bà mở cửa phòng của bác sĩ Fox và lảo đảo đi vào với tay đưa lên miệng.",
          "note": "Cụm từ này mô tả hành động đi loạng choạng, thường do mệt mỏi, đau đớn, hoặc mất thăng bằng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "clutch",
      "ipa": "/klʌtʃ/",
      "meaning": [
        {
          "vi": "nắm chặt, bám chặt",
          "example_en": "She fell down and clutched his feet.",
          "example_vi": "Cô ấy ngã xuống và nắm chặt chân anh ấy.",
          "note": "Dùng để miêu tả hành động nắm lấy một cách mạnh mẽ hoặc bám chặt vào cái gì đó vì lý do cảm xúc hoặc sự cần thiết."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "outwit",
      "ipa": "/aʊtˈwɪt/",
      "meaning": [
        {
          "vi": "lừa gạt, vượt qua bằng trí tuệ, thông minh hơn",
          "example_en": "She had been outwitted in the battle of the wills.",
          "example_vi": "Cô ấy đã bị lừa gạt trong cuộc đấu tranh ý chí.",
          "note": "Dùng khi ai đó bị vượt qua hoặc thua kém trong việc đối đầu bằng trí tuệ hoặc sự thông minh."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "infection",
      "ipa": "/ɪnˈfɛkʃən/",
      "meaning": [
        {
          "vi": "sự nhiễm trùng, bệnh nhiễm",
          "example_en": "I’m afraid that the infection was profound and systemic.",
          "example_vi": "Tôi e rằng nhiễm trùng đã lan rộng và ảnh hưởng toàn diện.",
          "note": "Dùng để chỉ sự nhiễm trùng hoặc sự xâm nhập của vi khuẩn, vi rút hoặc các tác nhân gây bệnh vào cơ thể, ảnh hưởng đến sức khỏe."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "swampy lungs",
      "ipa": "/ˈswɒm.pi lʌŋz/",
      "meaning": [
        {
          "vi": "phổi ẩm ướt, phổi khó thở (miêu tả phổi bị tắc nghẽn hoặc gặp khó khăn trong việc hô hấp)",
          "example_en": "I have very swampy lungs, and in times of distress, they often fail me.",
          "example_vi": "Tôi có phổi rất ẩm ướt, và trong những lúc căng thẳng, chúng thường không làm tôi thở được.",
          "note": "Cụm từ này không phải là một thuật ngữ y khoa chính thức, nhưng nó được dùng để miêu tả tình trạng phổi khó thở hoặc bị tắc nghẽn, có thể liên quan đến bệnh phổi hoặc các vấn đề hô hấp."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "squeeze",
      "ipa": "/skwiːz/",
      "meaning": [
        {
          "vi": "nắm chặt, siết chặt",
          "example_en": "Carol Anne took hold of my hand and squeezed it.",
          "example_vi": "Carol Anne nắm lấy tay tôi và siết chặt nó.",
          "note": "Dùng để miêu tả hành động nắm chặt hoặc ép một vật gì đó bằng tay, thường là để thể hiện sự quan tâm, an ủi, hoặc cảm xúc."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "dire",
      "ipa": "/daɪər/",
      "meaning": [
        {
          "vi": "nguy cấp, tồi tệ",
          "example_en": "My situation was growing ever more dire.",
          "example_vi": "Tình huống của tôi ngày càng trở nên nguy cấp.",
          "note": "Dùng để miêu tả tình huống hoặc hoàn cảnh rất tồi tệ, nghiêm trọng, thường có nguy cơ xấu xảy ra."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "recuperate",
      "ipa": "/rɪˈkjuːpəreɪt/",
      "meaning": [
        {
          "vi": "hồi phục, phục hồi sức khỏe",
          "example_en": "She will, of course, need to recuperate.",
          "example_vi": "Cô ấy, tất nhiên, cần phải hồi phục sức khỏe.",
          "note": "Dùng để chỉ quá trình hồi phục sau khi bị bệnh, bị thương hoặc mệt mỏi."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "antibiotics",
      "ipa": "/ˌæntɪbaɪˈɒtɪks/",
      "meaning": [
        {
          "vi": "kháng sinh",
          "example_en": "Antibiotics, painkillers, and bed rest.",
          "example_vi": "Kháng sinh, thuốc giảm đau, và nghỉ ngơi trên giường.",
          "note": "Thuốc kháng sinh là loại thuốc được sử dụng để điều trị các bệnh do vi khuẩn gây ra."
        }
      ],
      "cefr_level": "B1",
      "favorite": false
    },
    {
      "word": "pinprick",
      "ipa": "/ˈpɪnprɪk/",
      "meaning": [
        {
          "vi": "vết châm, vết đâm nhỏ",
          "example_en": "Pinprick on Sleeping Beauty’s finger.",
          "example_vi": "Vết châm trên ngón tay của Công chúa ngủ trong rừng.",
          "note": "Dùng để chỉ một vết đâm nhỏ, giống như vết châm của cây kim hoặc vật nhọn nhỏ."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "sentiment",
      "ipa": "/ˈsɛntɪmənt/",
      "meaning": [
        {
          "vi": "cảm xúc, quan điểm, ý kiến",
          "example_en": "This was a sentiment that I agreed with.",
          "example_vi": "Đây là một quan điểm mà tôi đồng ý.",
          "note": "Dùng để chỉ cảm xúc, ý kiến hoặc quan điểm về một vấn đề, có thể là tích cực hoặc tiêu cực."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "vicious",
      "ipa": "/ˈvɪʃəs/",
      "meaning": [
        {
          "vi": "tàn bạo, ác liệt, xấu xa",
          "example_en": "We were engaged in a vicious battle of the wills.",
          "example_vi": "Chúng tôi đã tham gia vào một cuộc đấu tranh ý chí ác liệt.",
          "note": "Dùng để miêu tả một hành động hoặc tình huống rất tàn bạo, nguy hiểm hoặc có tính chất xấu xa."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "horn",
      "ipa": "/hɔːrn/",
      "meaning": [
        {
          "vi": "còi, kèn, loa",
          "example_en": "Granny blew the horn again.",
          "example_vi": "Bà lại thổi còi một lần nữa.",
          "note": "Có thể chỉ đến một cái còi hoặc kèn (thường là dùng trong giao thông hoặc các tình huống thông báo)."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "tin",
      "ipa": "/tɪn/",
      "meaning": [
        {
          "vi": "hộp thiếc, lon",
          "example_en": "I raised the tin up higher so that it was in front of my heart like a shield.",
          "example_vi": "Tôi nâng chiếc hộp thiếc lên cao hơn để nó nằm trước trái tim tôi như một chiếc khiên.",
          "note": "Tin chỉ đến **hộp thiếc** hoặc vật dụng làm từ thiếc, thường dùng trong các đồ đựng thực phẩm hoặc vật dụng bảo quản."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "vestibule",
      "ipa": "/ˈvɛstɪbjuːl/",
      "meaning": [
        {
          "vi": "phòng chờ, hành lang",
          "example_en": "The good news is that there was a vending machine in the vestibule of the motel office.",
          "example_vi": "Tin tốt là có một máy bán hàng tự động trong phòng chờ của văn phòng nhà nghỉ.",
          "note": "Vestibule chỉ đến một **hành lang** hoặc **phòng chờ** ở lối vào của một tòa nhà, thường là khu vực tiếp đón."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "rain bonnets",
      "ipa": "/reɪn ˈbɒnɪts/",
      "meaning": [
        {
          "vi": "mũ che mưa",
          "example_en": "Rain bonnets that were folded up into neat little squares.",
          "example_vi": "Những chiếc mũ che mưa được gấp lại thành những hình vuông gọn gàng.",
          "note": "Rain bonnets là loại mũ mềm nhẹ, thường dùng để bảo vệ khỏi mưa, gọn nhẹ và có thể gấp lại khi không sử dụng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "contemplate",
      "ipa": "/ˈkɒntəmpleɪt/",
      "meaning": [
        {
          "vi": "suy ngẫm, suy nghĩ sâu sắc",
          "example_en": "The vending machine was such a miracle that as I stood and contemplated it.",
          "example_vi": "Máy bán hàng tự động là một phép màu đến mức tôi đứng đó và suy ngẫm về nó.",
          "note": "Dùng để miêu tả hành động suy nghĩ lâu dài hoặc xem xét một vấn đề một cách sâu sắc."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "alligator",
      "ipa": "/ˈælɪɡeɪtə/",
      "meaning": [
        {
          "vi": "cá sấu",
          "example_en": "And also, there was an alligator.",
          "example_vi": "Và cũng có một con cá sấu.",
          "note": "Alligator là một loài động vật bò sát lớn, sống chủ yếu ở khu vực nước ngọt, có hình dáng giống cá sấu."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "ferocious",
      "ipa": "/fəˈrəʊʃəs/",
      "meaning": [
        {
          "vi": "hung dữ, tàn bạo",
          "example_en": "But he was dead in a ferocious pose.",
          "example_vi": "Nhưng anh ta đã chết trong một tư thế hung dữ.",
          "note": "Ferocious dùng để mô tả một điều gì đó hoặc ai đó rất mạnh mẽ, tàn bạo, hoặc đáng sợ."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "curlers",
      "ipa": "/ˈkɜːlərz/",
      "meaning": [
        {
          "vi": "cuốn tóc",
          "example_en": "Her hair was in curlers.",
          "example_vi": "Tóc cô ấy đang được cuốn trong những chiếc cuốn tóc.",
          "note": "Curlers là dụng cụ cuốn tóc để tạo độ cong hoặc lọn tóc, thường dùng trong làm đẹp."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "whoop-de-do",
      "ipa": "/ˈwʊp dɪ duː/",
      "meaning": [
        {
          "vi": "phô trương, khoe khoang",
          "example_en": "It’s all mine and whoop-de-do and who cares.",
          "example_vi": "Tất cả là của tôi, khoe khoang và ai quan tâm.",
          "note": "Cụm từ này dùng để chỉ sự phô trương hoặc hành động làm mọi thứ trở nên quan trọng hóa mà không thực sự quan trọng."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "hardluck",
      "ipa": "/ˈhɑːdlʌk/",
      "meaning": [
        {
          "vi": "sự không may, xui xẻo",
          "example_en": "It’s clear that you have a hardluck story.",
          "example_vi": "Rõ ràng là bạn có một câu chuyện xui xẻo.",
          "note": "Hardluck chỉ tình huống không may mắn hoặc xui xẻo, thường xảy ra khi người ta gặp phải những khó khăn hoặc thất bại."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "ascertain",
      "ipa": "/ˌæsərˈteɪn/",
      "meaning": [
        {
          "vi": "xác định, làm rõ, chắc chắn",
          "example_en": "Nothing happens for free in this world, and I am not in the charity business, as you have surely ascertained by now.",
          "example_vi": "Không có gì miễn phí trong thế giới này, và tôi không làm công việc từ thiện, như bạn chắc chắn đã xác định được cho đến giờ.",
          "note": "Dùng để chỉ hành động **xác định rõ** hoặc **làm rõ** một vấn đề qua việc kiểm tra hoặc suy luận."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "pull quarters out of",
      "ipa": "/pʊld ˈkwɔːtəz aʊt ʌv/",
      "meaning": [
        {
          "vi": "lấy đồng xu ra từ (thường dùng trong các trò ảo thuật)",
          "example_en": "I pretended that he belonged to me and that he was the kind of uncle who pulled quarters out of your ear.",
          "example_vi": "Tôi giả vờ rằng anh ấy thuộc về tôi và là kiểu chú có thể lấy đồng xu từ tai bạn.",
          "note": "Cụm từ này mô tả hành động trong trò ảo thuật, khi một người giả vờ lấy vật gì đó (như đồng xu) từ một nơi bất ngờ, ví dụ như tai của ai đó."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "diminish",
      "ipa": "/dɪˈmɪnɪʃ/",
      "meaning": [
        {
          "vi": "giảm bớt, suy giảm",
          "example_en": "It did not seem to me that her powers were diminished at all.",
          "example_vi": "Dường như tôi không thấy sức mạnh của cô ấy bị suy giảm chút nào.",
          "note": "Dùng để miêu tả sự **giảm bớt** hoặc **suy yếu** của một thứ gì đó, có thể là năng lực, sức mạnh, hoặc giá trị."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "soar up",
      "ipa": "/sɔːr ʌp/",
      "meaning": [
        {
          "vi": "bay vút lên, tăng vọt lên",
          "example_en": "Well, my heart soared up high in my chest at those words.",
          "example_vi": "Lòng tôi bay vút lên cao trong ngực khi nghe những lời đó.",
          "note": "Cụm từ này miêu tả cảm giác **tăng vọt lên** hoặc **bay lên** cao, thường được dùng để diễn tả cảm xúc mạnh mẽ như vui mừng, hạnh phúc."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "broom",
      "ipa": "/bruːm/",
      "meaning": [
        {
          "vi": "chổi",
          "example_en": "And then Bernice came out of the motel office with a broom in her hand and the curlers still in her hair.",
          "example_vi": "Sau đó, Bernice bước ra khỏi văn phòng nhà nghỉ với một cái chổi trong tay và những chiếc cuốn tóc vẫn còn trên đầu.",
          "note": "Broom là dụng cụ lau dọn, thường có cán dài và đầu chổi làm từ sợi hoặc rơm, dùng để quét dọn sàn nhà."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "strike",
      "ipa": "/strʌk/",
      "meaning": [
        {
          "vi": "đập vào, gây ấn tượng mạnh",
          "example_en": "And then two things struck me at once.",
          "example_vi": "Và sau đó, hai điều đập vào tôi cùng lúc.",
          "note": "Dùng để miêu tả cảm giác mạnh mẽ hoặc ấn tượng đột ngột, thường xảy ra khi bạn nhận ra điều gì đó hoặc khi một ý tưởng mới nảy ra trong đầu."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "nightgown",
      "ipa": "/ˈnaɪtɡaʊn/",
      "meaning": [
        {
          "vi": "áo ngủ",
          "example_en": "She stood at the door in her nightgown.",
          "example_vi": "Cô ấy đứng ở cửa trong chiếc áo ngủ của mình.",
          "note": "Nightgown là một loại trang phục ngủ, thường dành cho phụ nữ, mềm mại và thoải mái."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "despair",
      "ipa": "/dɪˈspɛə/",
      "meaning": [
        {
          "vi": "sự tuyệt vọng",
          "example_en": "I felt a wave of darkness and despair roll over me.",
          "example_vi": "Tôi cảm thấy một làn sóng tối tăm và sự tuyệt vọng dâng lên trong tôi.",
          "note": "Despair là cảm giác **tuyệt vọng**, khi bạn cảm thấy không có hy vọng hoặc giải pháp cho vấn đề của mình."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "wondrous",
      "ipa": "/ˈwʌndrəs/",
      "meaning": [
        {
          "vi": "kỳ diệu, tuyệt vời",
          "example_en": "The vending machine stocked full of wondrous things.",
          "example_vi": "Máy bán hàng tự động chứa đầy những món đồ kỳ diệu.",
          "note": "Wondrous dùng để miêu tả điều gì đó rất đặc biệt hoặc kỳ diệu, gây ấn tượng mạnh với vẻ đẹp hoặc sự khác biệt."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "stained-glass",
      "ipa": "/steɪnd ɡlæs/",
      "meaning": [
        {
          "vi": "kính màu, kính vẽ hình (thường dùng trong cửa sổ, cửa ra vào, hoặc trang trí)",
          "example_en": "There was a stained-glass window above Miss Lulu’s head.",
          "example_vi": "Có một cửa sổ kính màu phía trên đầu cô Lulu.",
          "note": "Stained-glass là loại kính được trang trí với các màu sắc hoặc họa tiết, thường thấy trong các cửa sổ của nhà thờ hoặc các công trình kiến trúc cổ."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "kaleidoscope",
      "ipa": "/kəˈlaɪdəskəʊp/",
      "meaning": [
        {
          "vi": "kính vạn hoa",
          "example_en": "I could turn all the colors in the window into a kaleidoscope.",
          "example_vi": "Tôi có thể biến tất cả màu sắc trong cửa sổ thành một kính vạn hoa.",
          "note": "Kaleidoscope là một dụng cụ tạo ra những hình ảnh màu sắc thay đổi liên tục khi nhìn qua, tạo ra các hình ảnh đối xứng và đa dạng."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "splotch",
      "ipa": "/splɒtʃ/",
      "meaning": [
        {
          "vi": "vết bẩn, vết loang, vết màu",
          "example_en": "There was a big splotch of orange on her face from the stained glass.",
          "example_vi": "Có một vết loang màu cam lớn trên mặt cô ấy từ kính màu.",
          "note": "Splotch chỉ một vết bẩn hoặc vết loang, thường là do màu sắc hoặc chất lỏng bị vấy ra."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "angel-food cake",
      "ipa": "/ˈeɪndʒəl fʊd keɪk/",
      "meaning": [
        {
          "vi": "bánh ngọt nhẹ, bánh bông lan",
          "example_en": "And then Miss Lulu asked me if I liked angel-food cake.",
          "example_vi": "Sau đó, cô Lulu hỏi tôi có thích bánh ngọt nhẹ không.",
          "note": "Angel-food cake là một loại bánh ngọt nhẹ, làm từ lòng trắng trứng và đường, có kết cấu bông xốp và mềm, thường được dùng làm món tráng miệng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "cogitate",
      "ipa": "/ˈkɒdʒɪteɪt/",
      "meaning": [
        {
          "vi": "suy nghĩ, trầm tư",
          "example_en": "They did their planning and cogitating about how to make money from me.",
          "example_vi": "Họ đã lên kế hoạch và suy nghĩ về cách kiếm tiền từ tôi.",
          "note": "Cogitate có nghĩa là suy nghĩ một cách sâu sắc và cẩn thận, thường liên quan đến việc cân nhắc một vấn đề hoặc tình huống."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "salvation",
      "ipa": "/sælˈveɪʃən/",
      "meaning": [
        {
          "vi": "sự cứu rỗi, sự giải thoát",
          "example_en": "My salvation and rescue were at hand.",
          "example_vi": "Sự cứu rỗi và giải thoát của tôi đã gần kề.",
          "note": "Salvation thường dùng để chỉ sự cứu rỗi, giải thoát khỏi nguy hiểm, tội lỗi hoặc khó khăn, và có thể mang ý nghĩa tâm linh hoặc thực tế."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "obstacle",
      "ipa": "/ˈɒbstəkl/",
      "meaning": [
        {
          "vi": "chướng ngại vật, trở ngại",
          "example_en": "But there was one small obstacle.",
          "example_vi": "Nhưng có một trở ngại nhỏ.",
          "note": "Obstacle dùng để chỉ bất cứ thứ gì cản trở tiến trình, kế hoạch, hoặc mục tiêu, từ vật lý đến trừu tượng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "compromise",
      "ipa": "/ˈkɒmprəmaɪz/",
      "meaning": [
        {
          "vi": "bị tổn hại, bị ảnh hưởng, bị làm suy yếu",
          "example_en": "I am unwell and baffled and compromised. I would like to sleep.",
          "example_vi": "Tôi không khỏe, bối rối và bị tổn hại. Tôi muốn ngủ.",
          "note": "Compromise có thể chỉ tình trạng sức khỏe hoặc tình huống bị suy yếu hoặc gặp phải khó khăn do các yếu tố ngoại cảnh."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "resent",
      "ipa": "/rɪˈzɛnt/",
      "meaning": [
        {
          "vi": "bực tức, phẫn nộ",
          "example_en": "Do not bother resenting me, Louisiana.",
          "example_vi": "Đừng làm phiền vì bực tức tôi, Louisiana.",
          "note": "Resent chỉ cảm giác bực bội, phẫn nộ hoặc không hài lòng vì điều gì đó hoặc ai đó đã làm tổn thương bạn."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "swoop down",
      "ipa": "/swuːp daʊn/",
      "meaning": [
        {
          "vi": "lao xuống, bay xuống vội vàng",
          "example_en": "Clarence came swooping down from the sign and landed on the boy’s shoulder.",
          "example_vi": "Clarence lao xuống từ biển báo và hạ cánh lên vai cậu bé.",
          "note": "Cụm từ này miêu tả hành động **bay hoặc di chuyển xuống một cách vội vàng** hoặc mạnh mẽ, thường dùng khi miêu tả một vật thể hoặc sinh vật bay xuống từ trên cao."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "crow",
      "ipa": "/krəʊ/",
      "meaning": [
        {
          "vi": "quạ",
          "example_en": "The crow stared at me and I stared back at him.",
          "example_vi": "Con quạ nhìn chằm chằm vào tôi và tôi nhìn lại nó.",
          "note": "Crow là một loài chim đen, có tiếng kêu đặc trưng và thường xuất hiện trong các câu chuyện dân gian hoặc văn học."
        }
      ],
      "cefr_level": "A2",
      "favorite": false
    },
    {
      "word": "intensify",
      "ipa": "/ɪnˈtɛnsɪfaɪ/",
      "meaning": [
        {
          "vi": "làm tăng cường, làm dữ dội thêm",
          "example_en": "To speak of the curse only intensifies the curse.",
          "example_vi": "Nói về lời nguyền chỉ làm lời nguyền trở nên dữ dội hơn.",
          "note": "Intensify dùng để chỉ việc **làm tăng mức độ, sức mạnh hoặc cường độ** của một tình huống, cảm xúc hoặc hiện tượng."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "persevere",
      "ipa": "/ˌpɜːrsəˈvɪr/",
      "meaning": [
        {
          "vi": "kiên trì, bền bỉ, không bỏ cuộc",
          "example_en": "Maybe, in addition to being tired of imposing and persevering.",
          "example_vi": "Có lẽ, ngoài việc mệt mỏi vì cứ áp đặt, còn phải kiên trì nữa.",
          "note": "Persevere dùng để chỉ việc **tiếp tục nỗ lực, bền bỉ làm điều gì đó** mặc dù gặp khó khăn, thử thách hoặc mệt mỏi."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "handhold",
      "ipa": "/ˈhændhoʊld/",
      "meaning": [
        {
          "vi": "chỗ để tay bám, điểm bám tay",
          "example_en": "You can’t fall because there’s little bitty handholds the whole way up.",
          "example_vi": "Bạn không thể ngã vì có những chỗ để tay bé xíu suốt đường leo lên.",
          "note": "Dùng để chỉ những điểm mà người ta có thể bám tay vào để giữ thăng bằng hoặc leo lên, thường là trên vách đá, cầu thang hoặc vật cao."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "almost-not-there",
      "ipa": "/ˈɔːlmoʊst nɑːt ˈðɛr/",
      "meaning": [
        {
          "vi": "gần như không có, mờ nhạt",
          "example_en": "His almost-not-there hair glinted in the sunlight.",
          "example_vi": "Mái tóc gần như không có của anh ấy lấp lánh dưới ánh nắng.",
          "note": "Dùng để miêu tả thứ gì đó mỏng manh, mờ nhạt hoặc gần như không thể nhận thấy."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "caw",
      "ipa": "/kɔː/",
      "meaning": [
        {
          "vi": "kêu (tiếng quạ, chim)",
          "example_en": "Clarence showed up and he flew over our heads and cawed and cawed.",
          "example_vi": "Clarence xuất hiện và bay qua đầu chúng tôi và kêu liên tục.",
          "note": "Dùng để miêu tả tiếng kêu đặc trưng của quạ hoặc một số loài chim lớn."
        }
      ],
      "cefr_level": "B1",
      "favorite": false
    },
    {
      "word": "perch",
      "ipa": "/pɜːrtʃ/",
      "meaning": [
        {
          "vi": "đậu, ngồi trên (như chim đậu trên cành)",
          "example_en": "We sat out in the woods under a tree, and Clarence perched on one of the branches above us.",
          "example_vi": "Chúng tôi ngồi ngoài rừng dưới gốc cây, và Clarence đậu trên một cành cây phía trên chúng tôi.",
          "note": "Dùng để miêu tả hành động chim hoặc vật gì đó đặt hoặc ngồi trên vị trí cao, nhỏ hẹp, hoặc cành cây."
        }
      ],
      "cefr_level": "B1",
      "favorite": false
    },
    {
      "word": "utterances",
      "ipa": "/ˈʌtərənsɪz/",
      "meaning": [
        {
          "vi": "lời nói, câu nói, phát ngôn",
          "example_en": "These bologna sandwiches tasted so good that it was just one more reason for me to doubt Granny and the truth of her utterances.",
          "example_vi": "Những chiếc bánh mì bologna này ngon đến mức chỉ là thêm một lý do nữa để tôi nghi ngờ Granny và sự thật của những lời bà ấy nói.",
          "note": "Danh từ chỉ các lời nói, câu nói được phát ra; thường dùng trong văn viết hoặc khi nhấn mạnh tính chất lời nói."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "perplex",
      "ipa": "/pərˈplɛks/",
      "meaning": [
        {
          "vi": "làm bối rối, gây lúng túng",
          "example_en": "He was incredibly ferocious-looking, but he also seemed perplexed – as if he were thinking, How in the world did I end up here?",
          "example_vi": "Anh ta trông vô cùng dữ tợn, nhưng cũng có vẻ bối rối – như thể đang nghĩ, Làm sao mà tôi lại rơi vào đây?",
          "note": "Perplex (động từ) nghĩa là khiến ai đó cảm thấy bối rối, lúng túng; còn perplexed là tính từ chỉ trạng thái bối rối."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "infinitesimally",
      "ipa": "/ˌɪnfɪˈnɪtəsɪməli/",
      "meaning": [
        {
          "vi": "rất nhỏ, cực kỳ nhỏ bé",
          "example_en": "It did not feel to me like the earth was moving infinitesimally.",
          "example_vi": "Tôi không cảm thấy trái đất đang chuyển động một cách cực kỳ nhỏ bé.",
          "note": "Infinitesimally mô tả mức độ cực kỳ nhỏ, gần như không thể nhận thấy hoặc đo lường được."
        }
      ],
      "cefr_level": "C1",
      "favorite": true
    },
    {
      "word": "be blown by the winds of fate",
      "ipa": "/biː bloʊn baɪ ðə wɪndz əv feɪt/",
      "meaning": [
        {
          "vi": "bị cuốn theo chiều gió số phận",
          "example_en": "And speaking of being blown by the winds of fate, where was I going to go?",
          "example_vi": "Và nói về việc bị cuốn theo chiều gió số phận, tôi sẽ đi đâu đây?",
          "note": "Cụm từ ẩn dụ chỉ việc con người bị hoàn cảnh hoặc số phận đưa đẩy, không thể kiểm soát được con đường của mình."
        }
      ],
      "cefr_level": "C1",
      "favorite": true
    },
    {
      "word": "faint dead away",
      "ipa": "/feɪnt dɛd əˈweɪ/",
      "meaning": [
        {
          "vi": "ngất xỉu hoàn toàn",
          "example_en": "A woman was so excited about winning that she fainted dead away when Betty Allen called her number.",
          "example_vi": "Một người phụ nữ đã quá phấn khích vì chiến thắng đến mức cô ấy ngất xỉu hoàn toàn khi Betty Allen gọi số của mình.",
          "note": "Thành ngữ nhấn mạnh hành động ngất đi đột ngột vì sốc, sợ hãi, hoặc quá phấn khích. 'Dead away' chỉ mức độ hoàn toàn, triệt để."
        }
      ],
      "cefr_level": "B2",
      "favorite": true
    },
    {
      "word": "keep a low profile",
      "ipa": "/kiːp ə loʊ ˈproʊfaɪl/",
      "meaning": [
        {
          "vi": "giữ kín đáo, tránh sự chú ý",
          "example_en": "I got to keep a low profile. I can’t let nobody see me skipping school.",
          "example_vi": "Tôi phải giữ kín đáo, không thể để ai thấy mình trốn học.",
          "note": "Thành ngữ diễn tả việc cố gắng tránh sự chú ý, không để người khác để ý đến hành động hoặc sự hiện diện của mình."
        }
      ],
      "cefr_level": "B2",
      "favorite": true
    },
    {
      "word": "walrus",
      "ipa": "/ˈwɔːlrəs/",
      "meaning": [
        {
          "vi": "con hải mã",
          "example_en": "Reverend Obertask looked very much like a walrus and not one bit like a magician.",
          "example_vi": "Mục sư Obertask trông rất giống một con hải mã và chẳng giống một pháp sư chút nào.",
          "note": "Walrus là một loài động vật biển lớn, có răng nanh dài và ria mép dày, thường sống ở Bắc Cực."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "inadvertently",
      "ipa": "/ˌɪnədˈvɜːrtəntli/",
      "meaning": [
        {
          "vi": "vô tình, tình cờ, không cố ý",
          "example_en": "Reverend Obertask, the walrus-magician, was going to inadvertently set fire to the Sweet Shepherd Church!",
          "example_vi": "Mục sư Obertask, pháp sư-hải mã, đã vô tình gây cháy Nhà thờ Sweet Shepherd!",
          "note": "Inadvertently diễn tả hành động xảy ra một cách vô tình, không có chủ đích hoặc do bất cẩn."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "vale of tears",
      "ipa": "/veɪl əv tɪrz/",
      "meaning": [
        {
          "vi": "chốn nhân gian đầy đau khổ, cuộc đời nhiều buồn đau",
          "example_en": "Just a middle-aged man trying his best to make his way through this vale of tears.",
          "example_vi": "Chỉ là một người đàn ông trung niên đang cố gắng hết sức để đi qua chốn nhân gian đầy đau khổ này.",
          "note": "Thành ngữ văn chương, có nguồn gốc tôn giáo, mô tả cuộc đời trần thế như một nơi đầy khổ đau và thử thách."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "untoward",
      "ipa": "/ˌʌn.təˈwɔːrd/",
      "meaning": [
        {
          "vi": "bất thường, không mong muốn, rắc rối",
          "example_en": "But I’m worried that something, uh, untoward is occurring. Or will occur.",
          "example_vi": "Nhưng tôi lo rằng có điều gì đó bất thường đang xảy ra. Hoặc sẽ xảy ra.",
          "note": "Untoward là từ trang trọng, thường dùng để chỉ những sự việc không mong muốn, bất ngờ hoặc gây rắc rối."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "intervention",
      "ipa": "/ˌɪntərˈvenʃən/",
      "meaning": [
        {
          "vi": "sự can thiệp",
          "example_en": "Thank you for your generous insights and kind intervention.",
          "example_vi": "Cảm ơn vì những hiểu biết hào phóng và sự can thiệp tử tế của bạn.",
          "note": "Intervention là danh từ của 'intervene', thường dùng để chỉ hành động can thiệp để cải thiện tình huống hoặc ngăn chặn điều xấu xảy ra."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "dispense",
      "ipa": "/dɪˈspɛns/",
      "meaning": [
        {
          "vi": "phân phát, cung cấp (thường là dịch vụ, lời khuyên hoặc thuốc men)",
          "example_en": "On your door, it says that you dispense healing words.",
          "example_vi": "Trên cửa của bạn, có ghi rằng bạn ban phát những lời chữa lành.",
          "note": "Dispense thường dùng khi nói về việc cung cấp thuốc (dispense medicine) hoặc ban phát điều gì đó hữu ích như lời khuyên, công lý, sự chữa lành."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "be worse off",
      "ipa": "/biː wɜːrs ɔːf/",
      "meaning": [
        {
          "vi": "tệ hơn, rơi vào tình cảnh khó khăn hơn",
          "example_en": "I was worse off even than Pinocchio, a wooden puppet, who at least had a father who loved him and kept searching for him.",
          "example_vi": "Tôi còn tệ hơn cả Pinocchio, một con rối gỗ, ít nhất cũng có một người cha yêu thương và tìm kiếm cậu ấy.",
          "note": "Dùng để so sánh tình trạng của ai đó tệ hơn người khác hoặc so với trước đây, thường nói về tiền bạc, sức khỏe, hoặc hoàn cảnh sống."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "abscond",
      "ipa": "/æbˈskɒnd/",
      "meaning": [
        {
          "vi": "bỏ trốn, lẩn trốn (thường để tránh bị bắt hoặc tránh trách nhiệm)",
          "example_en": "Your grandmother has absconded, and I do not want to hear whatever hard-luck story you might have about that.",
          "example_vi": "Bà của cháu đã bỏ trốn, và ta không muốn nghe bất kỳ câu chuyện xui xẻo nào về việc đó.",
          "note": "Abscond thường dùng khi ai đó trốn đi một cách vội vàng và bí mật, đặc biệt để tránh bị bắt giữ hoặc né tránh nghĩa vụ pháp lý."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    },
    {
      "word": "weariness",
      "ipa": "/ˈwɪr.i.nəs/",
      "meaning": [
        {
          "vi": "sự mệt mỏi, kiệt sức",
          "example_en": "I felt a sudden wave of weariness.",
          "example_vi": "Tôi cảm thấy một làn sóng mệt mỏi bất chợt ập đến.",
          "note": "Weariness là danh từ chỉ trạng thái kiệt sức cả về thể chất lẫn tinh thần; thường gắn với fatigue (mệt nhọc) hoặc exhaustion (kiệt quệ)."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "pineapple upside-down cake",
      "ipa": "/ˈpaɪnˌæp.əl ˌʌp.saɪd ˈdaʊn keɪk/",
      "meaning": [
        {
          "vi": "bánh dứa úp ngược",
          "example_en": "I have never in my life had a pineapple upside-down cake.",
          "example_vi": "Trong đời tôi chưa bao giờ ăn bánh dứa úp ngược.",
          "note": "Đây là loại bánh ngọt được nướng với lát dứa (và thường có thêm anh đào) đặt ở đáy khuôn, khi lật ngược ra thì hoa văn trái cây hiện lên trên mặt bánh."
        }
      ],
      "cefr_level": "B2",
      "favorite": false
    },
    {
      "word": "truant",
      "ipa": "/ˈtruːənt/",
      "meaning": [
        {
          "vi": "học sinh trốn học",
          "example_en": "Burke Allen is nothing but a truant and vandal, and he will certainly do nothing to further this child’s moral education.",
          "example_vi": "Burke Allen chẳng là gì ngoài một học sinh trốn học và kẻ phá hoại, và chắc chắn cậu ta sẽ không làm gì để thúc đẩy việc giáo dục đạo đức của đứa trẻ này.",
          "note": "Truant là học sinh thường xuyên trốn học mà không có lý do chính đáng. Thường đi kèm với ý tiêu cực về kỷ luật hoặc đạo đức."
        }
      ],
      "cefr_level": "C1",
      "favorite": false
    }
  ]
}